Tekla Open API Reference for Tekla Structures 2025
Mesh Properties
The Mesh type exposes the following members.
Properties
Name | Description
Lines
 An array list of indices (as integers) pointing to the points array list. Two consecutive indices always represent a single line.
Points
 An array list of point objects representing the mesh points.
Triangles
 An array list of indices (as integers) pointing to the points array list. Three consecutive indices always represent a single triangle.
Top
See Also
Reference
Mesh Class
Tekla.Structures.Model.UI Namespace